In [1]:
import pandas as pd

df = pd.read_csv('../datasets/results-real.csv', sep="|")

df.head()

,image_name,comment_number,comment
0,1000092795.jpg,0,Two young guys with shaggy hair look at their...
1,1000092795.jpg,1,"Two young , White males are outside near many..."
2,1000092795.jpg,2,Two men in green shirts are standing in a yard .
3,1000092795.jpg,3,A man in a blue shirt standing in a garden .
4,1000092795.jpg,4,Two friends enjoy time spent together .

In [2]:
df.describe()

            image_name  comment_number                          comment
count           158915          158915                           158914
unique           31783               6                           158438
top     1000092795.jpg               0   Two dogs playing in the snow .
freq                 5           31783                                7

In [3]:
df = df.dropna() # drop the missing comment column

In [4]:
df.describe()

            image_name  comment_number                          comment
count           158914          158914                           158914
unique           31783               5                           158438
top     1000092795.jpg               0   Two dogs playing in the snow .
freq                 5           31783                                7

In [5]:
comments = df[' comment'].tolist()

In [6]:
len(comments)

158914

In [7]:
def remove_unnecessary_symbols(_my_text:str):
    unnecessary_symbols = [".", ",", "?", "/", '"', "'", ";", "`"]
    for i in unnecessary_symbols:
        _my_text = _my_text.replace(i, "")
    _my_text = _my_text.strip()
    _my_text = _my_text.replace("  "," ") # convert double space to one space
    _my_text = _my_text.lower()
    return _my_text

In [8]:
new_comments = []
for _c in comments:
    new_comment = remove_unnecessary_symbols(_c)
    new_comments.append(new_comment)

In [9]:
new_comments[:5]

['two young guys with shaggy hair look at their hands while hanging out in the yard',
 'two young white males are outside near many bushes',
 'two men in green shirts are standing in a yard',
 'a man in a blue shirt standing in a garden',
 'two friends enjoy time spent together']

In [10]:
df[' comment']=new_comments

In [11]:
df.head()

,image_name,comment_number,comment
0,1000092795.jpg,0,two young guys with shaggy hair look at their ...
1,1000092795.jpg,1,two young white males are outside near many bu...
2,1000092795.jpg,2,two men in green shirts are standing in a yard
3,1000092795.jpg,3,a man in a blue shirt standing in a garden
4,1000092795.jpg,4,two friends enjoy time spent together

In [12]:
df.describe()

            image_name  comment_number                       comment
count           158914          158914                        158914
unique           31783               5                        158317
top     1000092795.jpg               0  two dogs playing in the snow
freq                 5           31783                             7

In [13]:
df.isna().sum()

image_name         0
 comment_number    0
 comment           0
dtype: int64

In [14]:
df.columns

Index(['image_name', ' comment_number', ' comment'], dtype='object')

In [15]:
df = df.rename(
    columns={
        "image_name": "image_name",
        " comment": "comment",
        " comment_number": "comment_number",
    }
)

In [16]:
df.columns

Index(['image_name', 'comment_number', 'comment'], dtype='object')

In [17]:
df.to_csv('../datasets/updated-real-results.csv', index=False)

In [19]:
df1 = pd.read_csv('../datasets/updated-real-results.csv')

df1.head()

,image_name,comment_number,comment
0,1000092795.jpg,0,two young guys with shaggy hair look at their ...
1,1000092795.jpg,1,two young white males are outside near many bu...
2,1000092795.jpg,2,two men in green shirts are standing in a yard
3,1000092795.jpg,3,a man in a blue shirt standing in a garden
4,1000092795.jpg,4,two friends enjoy time spent together

In [20]:
df1['comment']

0         two young guys with shaggy hair look at their ...
1         two young white males are outside near many bu...
2            two men in green shirts are standing in a yard
3                a man in a blue shirt standing in a garden
4                     two friends enjoy time spent together
                                ...
158909    a man in shorts and a hawaiian shirt leans ove...
158910    a young man hanging over the side of a boat wh...
158911    a man is leaning off of the side of a blue and...
158912    a man riding a small boat in a harbor with fog...
158913    a man on a moored blue and white boat with hil...
Name: comment, Length: 158914, dtype: object